Lab 1

In [ ]:
num = input()
print("Even") if int(num) % 2 == 0 else print("Odd")

Odd

In [8]:
str1 = input()
print("Palindrome") if str1 == str1[::-1] else print("Not Palindrome")

Not Palindrome

In [10]:
lst1 = [12, 45, 5, 67, 9]
print(list([lst1[0], lst1[-1]]))

[12, 9]

In [1]:
def isPresent(lst, num):
    return num in lst

print(isPresent([1, 2, 3], 2))

True

In [8]:
import math

def isPrime (num):
    if num == 0 or num == 1:
        return False
    else:
        for i in range(2, math.isqrt(num) + 1):
            if num % i != 0:
                continue
            return False
        
        return True
    
a = [8, 9, 10, 11, 13, 81, 101, 100, 94]

for num in a:
    if (isPrime(num)):
        print(num**2)

121
169
10201

Lab 2

In [5]:
str1 = 'X-DSPAM-Confidence:0.8475'
num = float(str1.split(":")[1])
print(num+10)

10.8475

In [ ]:
data = [10,20,30,40,50,60,10,20]
data_set = list(dict.fromkeys(data))
print(data_set)
list(data_set)[-2:]

[10, 20, 30, 40, 50, 60]

[50, 60]

In [19]:
students = {
    1: {
        "name": "Aakash",
        "age": 24,
        "courses": ["DA", "DG"]
    },
    2: {
        "name": "Sanjay",
        "age": 24,
        "courses": ["DA", "AI"]
    },
    3: {
        "name": "Nat",
        "age": 24,
        "courses": ["AI", "DG"]
    }
}
print(students[1])
print(students[2]["age"])
print(students[2]["courses"])

{'name': 'Aakash', 'age': 24, 'courses': ['DA', 'DG']}
24
['DA', 'AI']

In [22]:
def pay_compute (hours, rate):
    pay = hours*rate
    if (hours>40):
        pay += 0.5*rate*(hours-40)
    return pay

pay_compute(45, 10)

475.0

In [12]:
data = [10,20,30,40,50,60,5,20]
print(f"The min number is:", min(data))
print(f"The max number is:", max(data))

The min number is: 5
The max number is: 60

In [29]:
while (True):
    inp = input()
    if (inp == "#"):
        continue
    elif (inp == "done"):
        print("Done!")
        break
    else:
        print(inp)

test
test2
test3
Done!

In [14]:
mix_data= [12,3,4.6,1, True, "Jhon", 124, "Diamond", 4.5]
type_dict = {int: "Integer", float: "Float", bool: "Bool", str: "String"}
result = {"Integer": 0, "Float": 0, "Bool": 0, "String": 0}
for val in mix_data:
    result[type_dict[type(val)]] += 1

for count in result:
    print(count, "count:", str(result[count]))
print("Total Element:", str(len(mix_data)))

Integer count: 4
Float count: 2
Bool count: 1
String count: 2
Total Element: 9

In [ ]:
data1 = [10,20,30,40,50,60,5,20]
print("Max: " + str(max(data1)))
print("Min: " + str(min(data1)))
print("Total: " + str(sum(data1)))

Max: 60
Min: 5
Total: 235

In [42]:
lst = []
while (True):
    inp = input("Enter a value? or done to exit")
    if (inp == "done"):
        break
    else:
        lst.append(inp)
        print(lst)

['we']
['we', 'er']
['we', 'er', 're']
['we', 'er', 're', 'tr']
['we', 'er', 're', 'tr', 'ty']

In [22]:
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/ywchiu/riii/master/data/house-prices.csv")
df = df.set_index("Home")
df.head()

       Price  SqFt  Bedrooms  Bathrooms  Offers Brick Neighborhood
Home
1     114300  1790         2          2       2    No         East
2     114200  2030         4          2       3    No         East
3     114800  1740         3          2       1    No         East
4      94700  1980         3          2       3    No         East
5     119800  2130         3          3       3    No         East

In [23]:
df[df["Bedrooms"]==2][["Price"]]

       Price
Home
1     114300
12    123000
19    111400
29     69100
32    112300
35    117800
37    117500
41    106600
43    105600
47    129800
49    115900
52     91100
53    117400
56    125700
62    100900
64    120500
66    111100
76    106900
83    164800
85     90500
90     97800
96    152500
98    126800
111   111600
112   114900
113   123600
120   109700
121   110400
123   144800
126   113500

In [27]:
max_price = df["Price"].max()
df.loc[df["Price"] == max_price]

       Price  SqFt  Bedrooms  Bathrooms  Offers Brick Neighborhood
Home
104   211200  2440         4          3       3   Yes         West

In [38]:
df.iloc[:][["Price", "Bedrooms", "Bathrooms", "Neighborhood"]]

       Price  Bedrooms  Bathrooms Neighborhood
Home
1     114300         2          2         East
2     114200         4          2         East
3     114800         3          2         East
4      94700         3          2         East
5     119800         3          3         East
...      ...       ...        ...          ...
124   119700         3          3         East
125   147900         4          3         East
126   113500         2          2        North
127   149900         3          3         West
128   124600         3          3        North

[128 rows x 4 columns]